fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорРеализации</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	ТекущаяДатаСервера = ОбщегоНазначенияКлиент.ДатаСеанса();

	Если НачалоМесяца(Объект.Период) > НачалоМесяца(ТекущаяДатаСервера) Тогда
		
		ТекстОшибки = "Ошибка: нельзя создавать акты за будущий период - " 
		              + Формат(Объект.Период, "ДФ='MMMM yyyy'") + "! Выберите актуальный месяц!";
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Объект.Период");
		
		Возврат; 	
	КонецЕсли;
	
	Объект.ДоговорРеализации.Очистить();

	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите период (месяц)!");
		Возврат;
	КонецЕсли;

	ПараметрыЗапуска = Новый Структура("Период", Объект.Период);

	РезультатФЗ = ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал = 1;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеСоздания", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФЗ, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Массовое создание документов";
	
	МассивАргументов = Новый Массив;
	МассивАргументов.Добавить(ПараметрыЗапуска);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, 
		"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументы", 
		МассивАргументов);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеСоздания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		МассивДанных = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		ЗаполнитьТаблицуНаСервере(МассивДанных);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("При работе возникла ошибка!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере(МассивДанных)
	
	Если МассивДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если МассивДанных.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Отлично! Реализации за выбранный период созданы!");
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Реализации были созданы ранее, новых Реализаций не создано");
	КонецЕсли;	
	 
	Для Каждого Стр Из МассивДанных Цикл
		НоваяСтрока = Объект.ДоговорРеализации.Добавить();
		НоваяСтрока.Договор = Стр.Договор;
		НоваяСтрока.Реализация = Стр.РеализацияТоваровУслуг;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
